# 1. Написать цикл для выведения на экран каждой буквы своего ФИО.

name = input('Введите своё ФИО >>> ').title()
for el in name:
  print(el)
